#include<stdio.h>
int main()
{
	int n = 9;
	float* p = (float *)&n;
	printf("n的值为：%d\n",n);
	printf("*p的值为：%f\n",*p);   //(1)
	/*对于（1）式(32位系统下)
		9(十进制) -->  00000000000000000000000000001001(二进制)
		0 00000000 00000000000000000001001  -->  E全部为0 -->  结果即为o	
	*/
	
	*p = 9.5;
	printf("n的值为：%d\n",n);     //(2)
	/*对于（2）式(32位系统下)
		9.5(十进制) -->  1001.1(二进制)          ！！！！！小数点后面的权重是2^-1,所以1*2^-1 = 0.5
		9.5 = (-1)^0*1.0011*2^3
		S = 0 ; E = 3 + 127 = 130 = 10000010 ; M = 00110000000000000000000 ; 
		内存存放形式：01000001000110000000000000000000
		现在要打印 %d，有符号整形（十进制） 
		由于 01000001000110000000000000000000的符号位是0，故原码反码补码相同，转化为10进制即为1092091904   			  
	*/
	printf("*p的值为：%f\n",*p);
	return 0;
}

